In [16]:
import pandas as pd
import numpy as np
from sklearn import linear_model
from word2number import w2n

In [54]:
df = pd.read_csv('https://raw.githubusercontent.com/codebasics/py/master/ML/2_linear_reg_multivariate/Exercise/hiring.csv', skiprows=1, names=['experience','test_score','interview_score','salary'])

In [36]:
df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [37]:
df.experience = df.experience.fillna('zero')

In [38]:
df

  experience  test_score  interview_score  salary
0       zero         8.0                9   50000
1       zero         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [39]:
median_interview = df.test_score.median()

In [40]:
df.test_score = df.test_score.fillna(median_interview)

In [45]:
df.experience= df.experience.apply(w2n.word_to_num)

In [46]:
reg= linear_model.LinearRegression()

In [47]:
reg.fit(df[['experience','test_score','interview_score']],df.salary)

LinearRegression()

In [48]:
reg.predict([[2,9,6]])

array([53205.96797671])

In [49]:
reg.predict([[12,10,10]])

array([92002.18340611])